# Button 
# 간단한 버튼으로 명령을 수행할 때 사용된다.

# Canvas
# 화면에 무언가를 그릴 때 사용한다

# Checkbutton
# 2가지의 구별되는 값을 가지는 변수를 표현한다.

# Entry
# 한 줄의 텍스트를 입력받는 필드이다.

# Frame
# 컨테이너 클래스이다 프레임은 경계선과 배경을 가지고 있다. 다른 위젯들을 그룹핑 하는데 사용된다.

# Label
# 텍스트나 이미지를 표시한다

# Listbox
# 선택 사항을 표시한다.

# Menu
# 메뉴를 표시한다. 풀다운 메뉴나 팝업 메뉴가 가능하다.

# Menubutton
# 메뉴 버튼이다 풀다운 메뉴가 가능하다. 

# 풀다운 메뉴 : 버튼을 클릭이나 터치 등의 상호작용을 통해 활성화했을 때, 보통 그 버튼의 아래로 하위 메뉴들이 펼쳐지는 요소 equal drop down

# Message
# 텍스트를 표시한다 레이블 위젯과 비슷하다 하지만 자동적으로 주어진 크기로 텍스트를 축소할 수 있다. 

# Radiobutton
# 여러 값을 가질 수 있는 변수를 표시한다 

# Scale 
# 슬라이더를 끌어서 수치값을 입력하는데 사용된다.

# Scrollbar
# 캔버스, 엔트리, 리스트 박스, 텍스트 위젯을 위한 스크롤바를 제공한다.

# Text 
# 형식을 가지는 텍스트를 표시한다. 여러 가지 스타일과 속성으로 텍스트를 표시할 수 있다.

# Toplevel
# 최상위 윈도우로 표시되는 독립적인 컨테이너 위젯이다 

# LabelFrame
# 경계선과 제목을 가지는 프레임 위젯의 변형이다.

# PanedWindow
# 자식 위젯들을 크기조절이 가능한 패널로 관리하는 컨테이너 위젯이다

# Spinbox
# 특정한 범위에서 값을 선택하는 엔트리 위젯의 변형

# 파이썬에서 제공하는 위젯은 단순 위젯과 컨테이너 위젯으로 나눈다
# 컨테이너란 다른 위젯들을 내부에 넣을 수 있는 위젯을 의미한다.

# 단순 위젯 : button, canvas, checkbutton, entry, label, message 등이 여기에 속한다.

# 컨테이너 컴포넌트 : frame, toplevel, label, frame, panedwindow 등이 여기에 속한다.

# 배치 관리자 : 배치 관리자는 컨테이너 안에서 위젯들의 위치와 크기를 결정하는 객체이다. 독서실에서는 보통 관리자가 있어서 
# 독서실에 출입하는 학생들의 위치를 결정해준다. 배치관리자도 위젯들의 위치와 크기를 관리한다.

# Grid : Grid Geometry Manager(격자 배치 관리자)는 테이블 형태의 배치, 위젯을 2차원적인 그리드에 배치한다. 

# Pack : Pack Geometry Manager(압축 배치 관리자)는 위젯들을 부모 위젯 안에 압축한다.
# 자식 위젯들을 사각형 블록으로 간주하여 프레임 안에 배치한다. 

# Place : Place Geometry manager(절대 배치 관리자)는 주어진 위치에 위젯을 배치한다. 
